:PROPERTIES:
:ID:       e8d2dcbf-df63-4849-91b2-fbfb5b02df02
:END:
#+TITLE: VyOS: Homelab Addressing
#+CATEGORY: slips
#+TAGS:

*** ipv4

#+begin_src emacs-lisp :tangle (expand-file-name "dc-ip-calc.el" "~/.dotfiles/.emacs.d/modules")
(defun ipv4-cidr-vec (cidr)
  "Returns the bitmask for ipv4 `cidr'."
  (when (or (< cidr 0) (> cidr 32))
    (error "NaF: Not a Function"))
  (let* ((cidr-lsb (mod cidr 8))
         (cidr-nib (mod (ash 255 (- 8 cidr-lsb)) 256)))
    ;; ((< cidr 9) (vector `[,cidr-nib 0 0 0])) ;; wtf
    (cond ((< cidr 1) (vector 0 0 0 0))
          ((< cidr 8) (vector cidr-nib 0 0 0))
          ((< cidr 16) (vector 255 cidr-nib 0 0))
          ((< cidr 24) (vector 255 255 cidr-nib 0))
          ((< cidr 32) (vector 255 255 255 cidr-nib))
          ([255 255 255 255]))))
#+end_src

And test...

=(->> muh clojure ...)=

#+begin_src emacs-lisp
(string-join
 (mapcar (apply-partially #'format "%S")
         (mapcar #'ipv4-cidr-vec (list 0 4 7 8 23 24 28 32)))
 "\n")
#+end_src

#+RESULTS:
: [0 0 0 0]
: [240 0 0 0]
: [254 0 0 0]
: [255 0 0 0]
: [255 255 254 0]
: [255 255 255 0]
: [255 255 255 240]
: [255 255 255 255]

**** ipv4 network address

Get the network address

#+begin_src emacs-lisp :tangle (expand-file-name "dc-ip-calc.el" "~/.dotfiles/.emacs.d/modules")
(defun ipv4-net-vec (ipv4 cidr)
  "Returns the network address for `ipv4' given `cidr' bits."
  (let ((ipv4-len (length ipv4)))
    (unless (vectorp ipv4) (error "NaV: Not a vec"))
    (when (or (< ipv4-len 4) (> ipv4-len 5))
      (error "Na4: Not an ipv4 vec"))
    (let* ((cidr-mask (ipv4-cidr-vec cidr))
           (avec (apply #'vector (number-sequence 0 3)))
           (ipv4-net (cl-map 'vector (lambda (i) (logand (aref cidr-mask i) (aref ipv4 i))) avec)))
      (or (and (= (length ipv4) 5) (vconcat ipv4-net (list (aref ipv4 4))))
          ipv4-net))))
#+end_src

And actually test the function above ...

#+begin_src emacs-lisp
(let* ((cidr-bits (list 1 4 7 8 23 24 28 31))
       (cidr-masks (mapcar #'ipv4-cidr-vec cidr-bits))
       (a (-rotate 2 cidr-bits))
       (b (reverse (-rotate 3 cidr-bits)))
       (c (mapcar (apply-partially #'logxor 247) cidr-bits))
       (d (->> (reverse c)
               (-rotate 5)
               (mapcar (apply-partially #'* (expt 3 3)))
               (mapcar (lambda (i) (mod i 247)))))
       ;; (oop-loop-args (-interleave cidr-bits cidr-masks ipv4-list d c b a))
       (ipv4-list (-interleave d c b a)))
  (let (ipv4-addrs ipv4-nets ipv4-cidrs ipv4-masks)
    (while (> (length ipv4-list) 0)
      ;; aw no cl-let...
      (let* ((bits (pop cidr-bits)) ;; no (take out) in drive-thru without (car!)
             (mask (pop cidr-masks))
             (addr (take 4 ipv4-list))
             (addr (apply #'vector addr))
             (net (ipv4-net-vec addr bits)) ;; <-- calling function, not reimplementing --v
             ;; (net (cl-map 'vector (lambda (i)
             ;;                        (logand (aref mask i) (aref addr i)))
             ;;              (number-sequence 0 3)))
             )
        (setq ipv4-list (nthcdr 4 ipv4-list))
        (message (format "%s/%s , %s/%s , %s"
                         (format-network-address addr t) bits
                         (format-network-address net t) bits
                         (format-network-address mask t)))
        (push addr ipv4-addrs)
        (push net ipv4-nets)
        (push mask ipv4-masks)
        ;; (push bits ipv4-cidrs)
        (let ((hwx-uwu (logxor (ash (- (expt 2 32) 1) (- bits)) (- (expt 2 32) 1)))) (push (format "%X" hwx-uwu) ipv4-cidrs))))
    (list ipv4-addrs ipv4-nets ipv4-cidrs ipv4-masks)))
#+end_src

#+RESULTS:
| [31 232 24 24]    | [170 235 28 23]   | [89 239 31 8]   | [220 224 1 7]   | [139 255 4 4] | [58 240 7 1] | [216 243 8 31] | [120 246 23 28] |
| [31 232 24 24]    | [170 235 28 16]   | [89 239 31 0]   | [220 224 0 0]   | [139 0 0 0]   | [58 0 0 0]   | [208 0 0 0]    | [0 0 0 0]       |
| FFFFFFFE          | FFFFFFF0          | FFFFFF00        | FFFFFE00        | FF000000      | FE000000     | F0000000       | 80000000        |
| [255 255 255 254] | [255 255 255 240] | [255 255 255 0] | [255 255 254 0] | [255 0 0 0]   | [254 0 0 0]  | [240 0 0 0]    | [128 0 0 0]     |

#+begin_src  emacs-lisp
(format "%X" (logxor (ash (- (expt 2 32) 1) -8) (- (expt 2 32) 1)))
;; (logand  (- (expt 2 31) 1))

(ash (- (expt 2 32) 1) -32)

;; == 2^30 + 2^31
;; (ash (ash (- (expt 2 32) 1) -30) 30) ;; 3221225472
;; (+ (expt 2 30) (expt 2 31))          ;; 3221225472
;;
;; meh
;; (mod (ash (expt 2 32) (- 32 bits)) (expt 2 32))
;; (- (- (expt 2 32) 1) (- (expt 2 bits) 1))
;;
;; (- (- (expt 2 32) 1) (- (expt 2 31) 1)) ;; ((2^32-1) - (2^31 - 1)) == 2^31 =~ leftsh(2^32, n) ... basically
#+end_src

**** It already formats addresses

#+begin_src emacs-lisp
(defun ipv6-vec-hexify (ipv6-vec)
  (cl-map 'vector (lambda (nib) (format "%0x" nib)) ipv6-vec))
#+end_src

#+begin_src emacs-lisp
(list (ipv6-vec-hexify [65535 65535 65535 65535 65535 65535 65535 65535])
      (string-join (hexify-ipv6-vec [65535 65535 65535 65535 65535 65535 65535 65535]) ":"))
#+end_src

#+RESULTS:
| [ffff ffff ffff ffff ffff ffff ffff ffff] | ffff:ffff:ffff:ffff:ffff:ffff:ffff:ffff |

... oh ... =format-network-address=


#+begin_src emacs-lisp
(format-network-address [65535 65535 65535 65535 65535 65535 65535 65535 0] t)
#+end_src

#+RESULTS:
: ffff:ffff:ffff:ffff:ffff:ffff:ffff:ffff

#+begin_src emacs-lisp :results output :eval never
(network-interface-list nil 'ipv6) ;; => list of cons
(network-interface-list t) ;; => alist

;; ("lo"
;;  [0 0 0 0 0 0 0 1 0]
;;  [0 0 0 0 0 0 0 1 0]
;;  [65535 65535 65535 65535 65535 65535 65535 65535 0])
#+end_src

#+RESULTS:
| lo     | [0 0 0 0 0 0 0 1 0] | [0 0 0 0 0 0 0 1 0] | [65535 65535 65535 65535 65535 65535 65535 65535 0] |
| enp4s0 | [10 123 45 67 0]    | [10 123 45 255 0]   | [255 255 255 0 0]                                   |
| lo     | [127 0 0 1 0]       | [127 255 255 255 0] | [255 0 0 0 0]                                       |

*** Underlay

Site Params

#+name: siteParams
|   | dnsSite | dnsDomain |
| ! | dnsSite | dnsDomain |
| # | homelab | dns.com   |

Addressing

#+name: underlay
|   | addr6                      | addr6net                  |         addr4 |     addr4net | ifx          | vrf     | vlan | dnsName | dnsParent  | ipv4prefix | ipv4site | ipv4subnet | ipv4host | ipv4cidr | pqdn             | fqdn                             | ipv6prefix | ipv6org | ipv6site | ipv6subnet | ipv6host | ipv6cidr | ifxUuid | nautoUuid |
| ! | addr6                      | addr6net                  |         addr4 |     addr4net | ifx          | vrf     | vlan | dnsName | dnsParent  | ipv4prefix | ipv4site | ipv4subnet | ipv4host | ipv4cidr | pqdn             | fqdn                             | ipv6prefix | ipv6org | ipv6site | ipv6subnet | ipv6host | ipv6cidr | ifxUuid | nautoUuid |
|---+----------------------------+---------------------------+---------------+--------------+--------------+---------+------+---------+------------+------------+----------+------------+----------+----------+------------------+----------------------------------+------------+---------+----------+------------+----------+----------+---------+-----------|
| # | fd01:2345:6789:4:0:0:0:65  | fd01:2345:6789:4:0:0:0:0  |  10.123.4.101 | 10.123.4.100 | en0          |         |      | wan     | vy1.via    |         10 |      123 |          4 |      101 |       30 | wan.vy1.via      | wan.vy1.via.homelab.dns.com      | fd01       |    2345 |     6789 | 4          | 65       |       64 | #ERROR  |           |
| # | fd01:2345:6789:5:0:0:0:b   | fd01:2345:6789:5:0:0:0:0  |   10.123.5.11 |   10.123.5.0 |              |         |    5 | dns     | vy1.via    |         10 |      123 |          5 |       11 |       24 | dns.vy1.via      | dns.vy1.via.homelab.dns.com      | fd01       |    2345 |     6789 | 5          | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:a:0:0:0:b   | fd01:2345:6789:a:0:0:0:0  |  10.123.10.11 |  10.123.10.0 | eth0         |         |   10 | lan     | vy1.via    |         10 |      123 |         10 |       11 |       24 | lan.vy1.via      | lan.vy1.via.homelab.dns.com      | fd01       |    2345 |     6789 | a          | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:94:0:0:0:b  | fd01:2345:6789:94:0:0:0:0 | 10.123.148.11 | 10.123.148.0 | eth1         |         |  110 | dev     | vy1.via    |         10 |      123 |        148 |       11 |       24 | dev.vy1.via      | dev.vy1.via.homelab.dns.com      | fd01       |    2345 |     6789 | 94         | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:a4:0:0:0:b  | fd01:2345:6789:a4:0:0:0:0 | 10.123.164.11 | 10.123.164.0 | eth1         |         |  210 | svc     | vy1.via    |         10 |      123 |        164 |       11 |       24 | svc.vy1.via      | svc.vy1.via.homelab.dns.com      | fd01       |    2345 |     6789 | a4         | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:a8:0:0:0:b  | fd01:2345:6789:a8:0:0:0:0 | 10.123.168.11 | 10.123.168.0 | eth2         |         |  220 | lab     | vy1.via    |         10 |      123 |        168 |       11 |       24 | lab.vy1.via      | lab.vy1.via.homelab.dns.com      | fd01       |    2345 |     6789 | a8         | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:b4:0:0:0:b  | fd01:2345:6789:b4:0:0:0:0 | 10.123.180.11 | 10.123.180.0 |              |         |      | util    | vy1.via    |         10 |      123 |        180 |       11 |       24 | util.vy1.via     | util.vy1.via.homelab.dns.com     | fd01       |    2345 |     6789 | b4         | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:c0:0:0:0:b  | fd01:2345:6789:c0:0:0:0:0 | 10.123.192.11 | 10.123.192.0 | eth3         |         |  410 | mgmt    | vy1.via    |         10 |      123 |        192 |       11 |       24 | mgmt.vy1.via     | mgmt.vy1.via.homelab.dns.com     | fd01       |    2345 |     6789 | c0         | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:c8:0:0:0:b  | fd01:2345:6789:c8:0:0:0:0 | 10.123.200.11 | 10.123.200.0 | eth3         |         |  420 | admin   | vy1.via    |         10 |      123 |        200 |       11 |       24 | admin.vy1.via    | admin.vy1.via.homelab.dns.com    | fd01       |    2345 |     6789 | c8         | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:e0:0:0:0:1  | fd01:2345:6789:e0:0:0:0:0 |  10.123.224.1 | 10.123.224.0 | veth4mgmtif1 | mgmtgw1 |      | mgmtif  | vy1.via    |         10 |      123 |        224 |        1 |       28 | mgmtif.vy1.via   | mgmtif.vy1.via.homelab.dns.com   | fd01       |    2345 |     6789 | e0         | 1        |       64 | #ERROR  |           |
| # | fd01:2345:6789:e0:0:0:0:b  | fd01:2345:6789:e0:0:0:0:0 | 10.123.224.11 | 10.123.224.0 | veth4mgmtgw1 | mgmtgw1 |      | mgmtgw  | vy1.via    |         10 |      123 |        224 |       11 |       28 | mgmtgw.vy1.via   | mgmtgw.vy1.via.homelab.dns.com   | fd01       |    2345 |     6789 | e0         | b        |       64 | #ERROR  |           |
| # | fd01:2345:6789:4:0:0:0:66  | fd01:2345:6789:4:0:0:0:0  |  10.123.4.102 | 10.123.4.100 | en0          |         |      | wan     | vy2.via    |         10 |      123 |          4 |      102 |       30 | wan.vy2.via      | wan.vy2.via.homelab.dns.com      | fd01       |    2345 |     6789 | 4          | 66       |       64 | #ERROR  |           |
| # | fd01:2345:6789:5:0:0:0:c   | fd01:2345:6789:5:0:0:0:0  |   10.123.5.12 |   10.123.5.0 |              |         |    5 | dns     | vy2.via    |         10 |      123 |          5 |       12 |       24 | dns.vy2.via      | dns.vy2.via.homelab.dns.com      | fd01       |    2345 |     6789 | 5          | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:a:0:0:0:c   | fd01:2345:6789:a:0:0:0:0  |  10.123.10.12 |  10.123.10.0 | eth0         |         |   10 | lan     | vy2.via    |         10 |      123 |         10 |       12 |       24 | lan.vy2.via      | lan.vy2.via.homelab.dns.com      | fd01       |    2345 |     6789 | a          | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:94:0:0:0:c  | fd01:2345:6789:94:0:0:0:0 | 10.123.148.12 | 10.123.148.0 | eth1         |         |  110 | dev     | vy2.via    |         10 |      123 |        148 |       12 |       24 | dev.vy2.via      | dev.vy2.via.homelab.dns.com      | fd01       |    2345 |     6789 | 94         | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:a4:0:0:0:c  | fd01:2345:6789:a4:0:0:0:0 | 10.123.164.12 | 10.123.164.0 | eth1         |         |  210 | svc     | vy2.via    |         10 |      123 |        164 |       12 |       24 | svc.vy2.via      | svc.vy2.via.homelab.dns.com      | fd01       |    2345 |     6789 | a4         | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:a8:0:0:0:c  | fd01:2345:6789:a8:0:0:0:0 | 10.123.168.12 | 10.123.168.0 | eth2         |         |  220 | lab     | vy2.via    |         10 |      123 |        168 |       12 |       24 | lab.vy2.via      | lab.vy2.via.homelab.dns.com      | fd01       |    2345 |     6789 | a8         | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:b4:0:0:0:c  | fd01:2345:6789:b4:0:0:0:0 | 10.123.180.12 | 10.123.180.0 |              |         |      | util    | vy2.via    |         10 |      123 |        180 |       12 |       24 | util.vy2.via     | util.vy2.via.homelab.dns.com     | fd01       |    2345 |     6789 | b4         | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:c0:0:0:0:c  | fd01:2345:6789:c0:0:0:0:0 | 10.123.192.12 | 10.123.192.0 | eth3         |         |  410 | mgmt    | vy2.via    |         10 |      123 |        192 |       12 |       24 | mgmt.vy2.via     | mgmt.vy2.via.homelab.dns.com     | fd01       |    2345 |     6789 | c0         | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:c8:0:0:0:c  | fd01:2345:6789:c8:0:0:0:0 | 10.123.200.12 | 10.123.200.0 | eth3         |         |  420 | admin   | vy2.via    |         10 |      123 |        200 |       12 |       24 | admin.vy2.via    | admin.vy2.via.homelab.dns.com    | fd01       |    2345 |     6789 | c8         | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:e0:0:0:0:2  | fd01:2345:6789:e0:0:0:0:0 |  10.123.224.2 | 10.123.224.0 | veth4mgmtif2 | mgmtgw2 |      | mgmtif  | vy2.via    |         10 |      123 |        224 |        2 |       28 | mgmtif.vy2.via   | mgmtif.vy2.via.homelab.dns.com   | fd01       |    2345 |     6789 | e0         | 2        |       64 | #ERROR  |           |
| # | fd01:2345:6789:e0:0:0:0:c  | fd01:2345:6789:e0:0:0:0:0 | 10.123.224.12 | 10.123.224.0 | veth4mgmtgw2 | mgmtgw2 |      | mgmtgw  | vy2.via    |         10 |      123 |        224 |       12 |       28 | mgmtgw.vy2.via   | mgmtgw.vy2.via.homelab.dns.com   | fd01       |    2345 |     6789 | e0         | c        |       64 | #ERROR  |           |
| # | fd01:2345:6789:a4:0:0:0:15 | fd01:2345:6789:a4:0:0:0:0 | 10.123.164.21 | 10.123.164.0 |              |         |  210 | svc     | svc1.via   |         10 |      123 |        164 |       21 |       24 | svc.svc1.via     | svc.svc1.via.homelab.dns.com     | fd01       |    2345 |     6789 | a4         | 15       |       64 | #ERROR  |           |
| # | fd01:2345:6789:a4:0:0:0:16 | fd01:2345:6789:a4:0:0:0:0 | 10.123.164.22 | 10.123.164.0 |              |         |  210 | svc     | svc2.via   |         10 |      123 |        164 |       22 |       24 | svc.svc2.via     | svc.svc2.via.homelab.dns.com     | fd01       |    2345 |     6789 | a4         | 16       |       64 | #ERROR  |           |
| # | fd01:2345:6789:a8:0:0:0:15 | fd01:2345:6789:a8:0:0:0:0 | 10.123.168.21 | 10.123.168.0 |              |         |  220 | lab     | svc1.via   |         10 |      123 |        168 |       21 |       24 | lab.svc1.via     | lab.svc1.via.homelab.dns.com     | fd01       |    2345 |     6789 | a8         | 15       |       64 | #ERROR  |           |
| # | fd01:2345:6789:a8:0:0:0:16 | fd01:2345:6789:a8:0:0:0:0 | 10.123.168.22 | 10.123.168.0 |              |         |  220 | lab     | svc2.via   |         10 |      123 |        168 |       22 |       24 | lab.svc2.via     | lab.svc2.via.homelab.dns.com     | fd01       |    2345 |     6789 | a8         | 16       |       64 | #ERROR  |           |
| # | fd01:2345:6789:c0:0:0:0:1f | fd01:2345:6789:c0:0:0:0:0 | 10.123.192.31 | 10.123.192.0 |              |         |  410 | mgmt    | svc1.via   |         10 |      123 |        192 |       31 |       24 | mgmt.svc1.via    | mgmt.svc1.via.homelab.dns.com    | fd01       |    2345 |     6789 | c0         | 1f       |       64 | #ERROR  |           |
| # | fd01:2345:6789:c0:0:0:0:20 | fd01:2345:6789:c0:0:0:0:0 | 10.123.192.32 | 10.123.192.0 |              |         |  410 | mgmt    | svc2.via   |         10 |      123 |        192 |       32 |       24 | mgmt.svc2.via    | mgmt.svc2.via.homelab.dns.com    | fd01       |    2345 |     6789 | c0         | 20       |       64 | #ERROR  |           |
| # | fd01:2345:6789:c0:0:0:0:1  | fd01:2345:6789:c0:0:0:0:0 |  10.123.192.1 | 10.123.192.0 |              |         |      | mgmt    | sw1.via    |         10 |      123 |        192 |        1 |       24 | mgmt.sw1.via     | mgmt.sw1.via.homelab.dns.com     | fd01       |    2345 |     6789 | c0         | 1        |       64 | #ERROR  |           |
| # | fd01:2345:6789:c0:0:0:0:2  | fd01:2345:6789:c0:0:0:0:0 |  10.123.192.2 | 10.123.192.0 |              |         |      | mgmt    | sw2.via    |         10 |      123 |        192 |        2 |       24 | mgmt.sw2.via     | mgmt.sw2.via.homelab.dns.com     | fd01       |    2345 |     6789 | c0         | 2        |       64 | #ERROR  |           |
| # | fd01:2345:6789:c0:0:0:0:15 | fd01:2345:6789:c0:0:0:0:0 | 10.123.192.21 | 10.123.192.0 |              |         |  410 | mgmt    | mgmt1.via  |         10 |      123 |        192 |       21 |       24 | mgmt.mgmt1.via   | mgmt.mgmt1.via.homelab.dns.com   | fd01       |    2345 |     6789 | c0         | 15       |       64 | #ERROR  |           |
| # | fd01:2345:6789:c8:0:0:0:1f | fd01:2345:6789:c8:0:0:0:0 | 10.123.200.31 | 10.123.200.0 |              |         |  420 | admin   | mgmt1.via  |         10 |      123 |        200 |       31 |       24 | admin.mgmt1.via  | admin.mgmt1.via.homelab.dns.com  | fd01       |    2345 |     6789 | c8         | 1f       |       64 | #ERROR  |           |
| # | fd01:2345:6789:c0:0:0:0:16 | fd01:2345:6789:c0:0:0:0:0 | 10.123.192.22 | 10.123.192.0 |              |         |  410 | mgmt    | mgmt2.via  |         10 |      123 |        192 |       22 |       24 | mgmt.mgmt2.via   | mgmt.mgmt2.via.homelab.dns.com   | fd01       |    2345 |     6789 | c0         | 16       |       64 | #ERROR  |           |
| # | fd01:2345:6789:c8:0:0:0:20 | fd01:2345:6789:c8:0:0:0:0 | 10.123.200.32 | 10.123.200.0 |              |         |  420 | admin   | mgmt2.via  |         10 |      123 |        200 |       32 |       24 | admin.mgmt2.via  | admin.mgmt2.via.homelab.dns.com  | fd01       |    2345 |     6789 | c8         | 20       |       64 | #ERROR  |           |
| # | fd01:2345:6789:c8:0:0:0:15 | fd01:2345:6789:c8:0:0:0:0 | 10.123.200.21 | 10.123.200.0 |              |         |  420 | admin   | admin1.via |         10 |      123 |        200 |       21 |       24 | admin.admin1.via | admin.admin1.via.homelab.dns.com | fd01       |    2345 |     6789 | c8         | 15       |       64 | #ERROR  |           |
| # | fd01:2345:6789:c8:0:0:0:16 | fd01:2345:6789:c8:0:0:0:0 | 10.123.200.22 | 10.123.200.0 |              |         |  420 | admin   | admin1.via |         10 |      123 |        200 |       22 |       24 | admin.admin1.via | admin.admin1.via.homelab.dns.com | fd01       |    2345 |     6789 | c8         | 16       |       64 | #ERROR  |           |
#+TBLFM: $16='(string-join (list $dnsName $dnsParent) ".");
#+TBLFM: $17='(string-join (list $pqdn dnsSite dnsDomain) ".");
#+TBLFM: $4='(format-network-address (vector $ipv4prefix $ipv4site $ipv4subnet $ipv4host));N
#+TBLFM: $5='(format-network-address (ipv4-net-vec (vector $ipv4prefix $ipv4site $ipv4subnet $ipv4host) $ipv4cidr));N
#+TBLFM: $21='(format "%x" $ipv4subnet);N
#+TBLFM: $22='(format "%x" $ipv4host);N
#+TBLFM: $2='(format-network-address (cl-map 'vector #'hexnib (list $ipv6prefix $ipv6org $ipv6site $ipv6subnet "0" "0" "0" $ipv6host)));
#+TBLFM: $3='(format-network-address (ipv6-net-vec (cl-map 'vector #'hexnib (list $ipv6prefix $ipv6org $ipv6site $ipv6subnet "0" "0" "0" $ipv6host)) (string-to-number $ipv6cidr)));
*** ipv4 trie

#+begin_src python :session *py-session* :var nets=trieNets4 addrs=trieAddrs4 parents=trieParents4
p4 = pyt.PyTricia(32)
parents = addrs_parse(parents)
trie_insert(p4,parents)
nets = addrs_parse(nets)
trie_insert(p4,nets)
addrs = addrs_parse(addrs)
trie_insert(p4,addrs)
#+end_src

#+RESULTS:
: <pytricia.PyTricia object at 0x7ff38d2e3af0>

#+name: trieParents4
#+begin_example
8,10.0.0.0
16,10.8.0.0
17,10.8.0.0
17,10.8.128.0
18,10.8.128.0
19,10.8.160.0
18,10.8.192.0
21,10.8.200.0
20,10.8.0.0
21,10.8.0.0
#+end_example

